MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
/**
 *******************************************************************************
 * @file hc32_ll_sdfm.c
 * @brief This file provides firmware functions to manage the Sigma-Delta Filter
 *        Modulator (SDFM).
  @verbatim
   Change Logs:
   Date             Author          Notes
   2026-04-16       CDT             First version
  @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2026, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_sdfm.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_SDFM SDFM
 * @brief SDFM Driver Library
 * @{
 */

#if (LL_SDFM_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SDFM_Local_Macros SDFM Local Macros
 * @{
 */
/* Delay count for RMU reset timeout */
#define SDFM_RMU_TIMEOUT (100UL)

#define SDFM_CKAB_TIMEOUT (50000U)

/* The maximum channel/filter number */
#define SDFM_CH_MAX     (SDFM_CH7)
#define SDFM_FILTER_MAX (SDFM_FILTER3)

/* Initialization mask */
#define SDFM_CHCFGR1_INIT_MASK                                                                                     \
    (SDFM_CHCFGR1_DATPACK | SDFM_CHCFGR1_DATMPX | SDFM_CHCFGR1_CHINSEL | SDFM_CHCFGR1_SITP | SDFM_CHCFGR1_SPICKSEL \
     | SDFM_CHCFGR1_SDCLKSEL | SDFM_CHCFGR1_SDCLKSYNC | SDFM_CHCFGR1_SDDATASYNC)
#define SDFM_CHCFGR2_INIT_MASK (SDFM_CHCFGR2_OFFSET | SDFM_CHCFGR2_DTRBS)

#define SDFM_FLTCR1_INIT_MASK                                                                                \
    (SDFM_FLTCR1_AWFSEL | SDFM_FLTCR1_FAST | SDFM_FLTCR1_RCH | SDFM_FLTCR1_RDMAEN | SDFM_FLTCR1_RSYNC        \
     | SDFM_FLTCR1_RCONT | SDFM_FLTCR1_JDMAEN | SDFM_FLTCR1_JEXTEN | SDFM_FLTCR1_JEXTSEL | SDFM_FLTCR1_JSCAN \
     | SDFM_FLTCR1_JSYNC | SDFM_FLTCR1_JSCAN_TYPE | SDFM_FLTCR1_OVDEL)

#define SDFM_FLTCR1_REGU_CFG_MASK \
    (SDFM_FLTCR1_FAST | SDFM_FLTCR1_RCH | SDFM_FLTCR1_RDMAEN | SDFM_FLTCR1_RSYNC | SDFM_FLTCR1_RCONT)

#define SDFM_FLTCR1_INJ_CFG_MASK                                                                           \
    (SDFM_FLTCR1_JDMAEN | SDFM_FLTCR1_JEXTEN | SDFM_FLTCR1_JEXTSEL | SDFM_FLTCR1_JSCAN | SDFM_FLTCR1_JSYNC \
     | SDFM_FLTCR1_JSCAN_TYPE)

#define SDFM_FLTFIFOCTL_INIT_MASK \
    (SDFM_FLTFIFOCTL_SDFFIL | SDFM_FLTFIFOCTL_WTSYNCEN | SDFM_FLTFIFOCTL_FFSYNCLREN | SDFM_FLTFIFOCTL_WTSCLREN)

#define SDFM_FLTEVTFLTCTL_INIT_MASK (SDFM_FLTEVTFITCTL_SAMPWIN1 | SDFM_FLTEVTFITCTL_THRESH1)

#define SDFM_FLTCPARM_INIT_MASK (SDFM_FLTCPARM_CEVT1DIGFILTSEL | SDFM_FLTCPARM_CEVT1SEL | SDFM_FLTCPARM_EN_CEVT1)

/**
 * @defgroup SDFM_Check_Parameters_Validity SDFM Check Parameters Validity
 * @{
 */
#define IS_SDFM_BIT_MASK(x, mask) (((x) != 0U) && (((x) | (mask)) == (mask)))

#define IS_SDFM(x) ((x) == CM_SDFM)

#define IS_SDFM_CH(x) ((x) <= SDFM_CH_MAX)

#define IS_SDFM_MX_CH(x) IS_SDFM_BIT_MASK(x, SDFM_MX_CH_ALL)

#define IS_SDFM_FILTER(x) ((x) <= SDFM_FILTER_MAX)

#define IS_SDFM_SYNC_FILTER(x) (((x) > SDFM_FILTER0) && ((x) <= SDFM_FILTER_MAX))

#define IS_SDFM_EVEN_CH(x) (((x) == SDFM_CH0) || ((x) == SDFM_CH2) || ((x) == SDFM_CH4) || ((x) == SDFM_CH6))

#define IS_SDFM_CH_SCD_THRESHOLD(x) ((x) <= 0xFFU)

#define IS_SDFM_BREAK_SIGNAL(x) ((x) <= 0xFU)

#define IS_SDFM_CH_DELAY(x) ((x) <= 63U)

#define IS_SDFM_CH_CKOUT_SRC(x) (((x) == SDFM_CH_OUTPUT_CLK_SYS) || ((x) == SDFM_CH_OUTPUT_CLK_AUDIO))

#define IS_SDFM_CH_CKOUT_DIV(x) (((x) >= 2U) && ((x) <= 256U))

#define IS_SDFM_CH_INPUT_MUX(x) (((x) == SDFM_CH_INPUT_DATA_EXT) || ((x) == SDFM_CH_INPUT_DATA_INTERN_REG))

#define IS_SDFM_CH_DATA_PACKING(x)                                                              \
    (((x) == SDFM_CH_INPUT_DATA_PACKING_STD) || ((x) == SDFM_CH_INPUT_DATA_PACKING_INTERLEAVED) \
  || ((x) == SDFM_CH_INPUT_DATA_PACKING_DUAL))

#define IS_SDFM_CH_INPUT(x) (((x) == SDFM_CH_INPUT_PIN_SAME_CH_PIN) || ((x) == SDFM_CH_INPUT_PIN_FOLLOW_CH_PIN))

#define IS_SDFM_CH_CAD(x) (((x) == SDFM_CH_CKAB_DISABLE) || ((x) == SDFM_CH_CKAB_ENABLE))

#define IS_SDFM_CH_SCD(x) (((x) == SDFM_CH_SCD_DISABLE) || ((x) == SDFM_CH_SCD_ENABLE))

#define IS_SDFM_CH_SERIAL_INTF_TYPE(x)                                                   \
    (((x) == SDFM_CH_SERIAL_INTF_SPI_RISING) || ((x) == SDFM_CH_SERIAL_INTF_SPI_FALLING) \
  || ((x) == SDFM_CH_SERIAL_INTF_MANCHESTER_RISING) || ((x) == SDFM_CH_SERIAL_INTF_MANCHESTER_FALLING))

#define IS_SDFM_CH_SPI_CLK(x)                                                                                        \
    (((x) == SDFM_CH_SPI_CLK_EXT) || ((x) == SDFM_CH_SPI_CLK_INTERN) || ((x) == SDFM_CH_SPI_CLK_INTERN_DIV2_FALLING) \
  || ((x) == SDFM_CH_SPI_CLK_INTERN_DIV2_RISING))

#define IS_SDFM_CH_CLK_SEL(x) (((x) == SDFM_CH_CLK_SEL_SELF) || ((x) == SDFM_CH_CLK_SEL_CH0))

#define IS_SDFM_CH_CLK_SYNC(x) (((x) == SDFM_CH_CLK_SYNC_DISABLE) || ((x) == SDFM_CH_CLK_SYNC_ENABLE))

#define IS_SDFM_CH_DATA_SYNC(x) (((x) == SDFM_CH_DATA_SYNC_DISABLE) || ((x) == SDFM_CH_DATA_SYNC_ENABLE))

#define IS_SDFM_CH_AWD_SINC_ORDER(x)                                                   \
    (((x) == SDFM_CH_AWD_SINC_ORDER_FASTSINC) || ((x) == SDFM_CH_AWD_SINC_ORDER_SINC1) \
  || ((x) == SDFM_CH_AWD_SINC_ORDER_SINC2) || ((x) == SDFM_CH_AWD_SINC_ORDER_SINC3))

#define IS_SDFM_CH_AWD_SINC_FOSR(x) (((x) >= 1U) && ((x) <= 32U))

#define IS_SDFM_REGU_FAST_MD(x) (((x) == SDFM_FILTER_REGU_FAST_MD_DISABLE) || ((x) == SDFM_FILTER_REGU_FAST_MD_ENABLE))

#define IS_SDFM_REGU_DMA(x) (((x) == SDFM_FILTER_REGU_DMA_DISABLE) || ((x) == SDFM_FILTER_REGU_DMA_ENABLE))

#define IS_SDFM_REGU_SYNC_START(x) \
    (((x) == SDFM_FILTER_REGU_SYNC_START_DISABLE) || ((x) == SDFM_FILTER_REGU_SYNC_START_ENABLE))

#define IS_SDFM_REGU_CONT_MD(x) (((x) == SDFM_FILTER_REGU_CONT_MD_DISABLE) || ((x) == SDFM_FILTER_REGU_CONT_MD_ENABLE))

#define IS_SDFM_INJ_EXT_TRIG(x)           \
    (((x) <= SDFM_FILTER_EXT_TRIG_JTRG20) \
  || (((x) >= SDFM_FILTER_EXT_TRIG_JTRG24) && ((x) <= SDFM_FILTER_EXT_TRIG_JTRG31)))

