MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
#define IS_SDFM_INJ_EXT_TRIG_EDGE(x)                                                    \
    (((x) == SDFM_FILTER_EXT_TRIG_DISABLE) || ((x) == SDFM_FILTER_EXT_TRIG_EDGE_RISING) \
  || ((x) == SDFM_FILTER_EXT_TRIG_EDGE_FALLING) || ((x) == SDFM_FILTER_EXT_TRIG_EDGE_BOTH))

#define IS_SDFM_INJ_SCAN_MD(x) (((x) == SDFM_FILTER_INJ_SCAN_MD_DISABLE) || ((x) == SDFM_FILTER_INJ_SCAN_MD_ENABLE))

#define IS_SDFM_INJ_SYNC_START(x) \
    (((x) == SDFM_FILTER_INJ_SYNC_START_DISABLE) || ((x) == SDFM_FILTER_INJ_SYNC_START_ENABLE))

#define IS_SDFM_INJ_DMA(x) (((x) == SDFM_FILTER_INJ_DMA_DISABLE) || ((x) == SDFM_FILTER_INJ_DMA_ENABLE))

#define IS_SDFM_INJ_TYPE(x) (((x) == SDFM_FILTER_INJ_TYPE_COMM) || ((x) == SDFM_FILTER_INJ_TYPE_FIFO))

#define IS_SDFM_FILTER_SINC_FOSR_ORDER(osr, odr)                                         \
    ((((odr) == SDFM_FILTER_SINC_ORDER_FASTSINC) && (((osr) >= 1U) && ((osr) <= 1024U))) \
  || (((odr) == SDFM_FILTER_SINC_ORDER_SINC1) && (((osr) >= 1U) && ((osr) <= 1024U)))    \
  || (((odr) == SDFM_FILTER_SINC_ORDER_SINC2) && (((osr) >= 1U) && ((osr) <= 1024U)))    \
  || (((odr) == SDFM_FILTER_SINC_ORDER_SINC3) && (((osr) >= 1U) && ((osr) <= 1024U)))    \
  || (((odr) == SDFM_FILTER_SINC_ORDER_SINC4) && (((osr) >= 1U) && ((osr) <= 215U)))     \
  || (((odr) == SDFM_FILTER_SINC_ORDER_SINC5) && (((osr) >= 1U) && ((osr) <= 73U))))

#define IS_SDFM_FILTER_SINC_IOSR(x) (((x) >= 1U) && ((x) <= 256U))

#define IS_SDFM_FILTER_AWD_DATA_SRC(x) (((x) == SDFM_FILTER_AWD_FILTER_DATA) || ((x) == SDFM_FILTER_AWD_CH_DATA))

#define IS_SDFM_FILTER_OVF_DEAL(x) (((x) == SDFM_FILTER_OVF_CLAMPING) || ((x) == SDFM_FILTER_OVF_CUTTING))

#define IS_SDFM_FILTER_INT(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_INT_ALL)

#define IS_SDFM_FILTER_CH_INT(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_CH_INT_ALL)

#define IS_SDFM_FILTER_FLAG(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_FLAG_ALL)

#define IS_SDFM_FILTER_CH_FLAG(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_CH_FLAG_ALL)

#define IS_SDFM_FILTER_FLAG_CLR(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_FLAG_CLR_ALL)

#define IS_SDFM_FILTER_AWD_THRESHOLD(x) (((x) >= -8388608) && ((x) <= 8388607))

#define IS_SDFM_FILTER_AWD_FLAG(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_AWD_FLAG_ALL)

#define IS_SDFM_CH_CAL_OFFSET(x) (((x) >= -8388608) && ((x) <= 8388607))

#define IS_SDFM_CH_RIGHT_BIT_SHIFT(x) ((x) <= 31U)

#define IS_SDFM_FILTER_FIFO_INT_LEVEL(x) ((x) <= 15U)

#define IS_SDFM_FILTER_FIFO_WAIT_FOR_SYNC(x) \
    (((x) == SDFM_FILTER_FIFO_WAIT_FOR_SYNC_DISABLE) || ((x) == SDFM_FILTER_FIFO_WAIT_FOR_SYNC_ENABLE))

#define IS_SDFM_FILTER_FIFO_CLR_ON_SYNC(x) \
    (((x) == SDFM_FILTER_FIFO_CLR_ON_SYNC_DISABLE) || ((x) == SDFM_FILTER_FIFO_CLR_ON_SYNC_ENABLE))

#define IS_SDFM_FILTER_FIFO_FLAG_CLR_ON_INT(x) \
    (((x) == SDFM_FILTER_FIFO_FLAG_CLR_ON_INT_DISABLE) || ((x) == SDFM_FILTER_FIFO_FLAG_CLR_ON_INT_ENABLE))

#define IS_SDFM_FILTER_FIFO_FLAG(x) IS_SDFM_BIT_MASK(x, SDFM_FILTER_FIFO_FLAG_ALL)

#define IS_SDFM_FILTER_CEVT(x) (((x) == SDFM_FILTER_CEVT1) || ((x) == SDFM_FILTER_CEVT2))

#define IS_SDFM_FILTER_CEVT_INPUT(x) ((x) <= 0x3UL)

#define IS_SDFM_FILTER_CEVT_OUTPUT(x) \
    (((x) == SDFM_FILTER_CEVT_OUTPUT_RAW) || ((x) == SDFM_FILTER_CEVT_OUTPUT_FILTERED))

#define IS_SDFM_FILTER_CEVT_DF_SPL_WINDOW(x) (((x) >= 1U) && ((x) <= 32U))

#define IS_SDFM_FILTER_CEVT_DF_VOTING_THRESHOLD(x) ((x) <= 31U)

/**
 * @}
 */

/**
 * @defgroup SDFM_Register_Def SDFM Register Definition
 * @{
 */
#define SDFM_CHyCFGR1(ch)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x00UL + (ch) * 0x20UL))
#define SDFM_CHyCFGR2(ch)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x04UL + (ch) * 0x20UL))
#define SDFM_CHyAWSCDR(ch) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x08UL + (ch) * 0x20UL))
#define SDFM_CHyWDATR(ch)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x0CUL + (ch) * 0x20UL))
#define SDFM_CHyDATINR(ch) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x10UL + (ch) * 0x20UL))
#define SDFM_CHyDLYR(ch)   (*(__IO uint32_t *)(CM_SDFM_BASE + 0x14UL + (ch) * 0x20UL))
#define SDFM_CHyHLTZ(ch)   (*(__IO uint32_t *)(CM_SDFM_BASE + 0x18UL + (ch) * 0x20UL))

#define SDFM_FLTxCR1(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x100UL + (flt) * 0x80UL))
#define SDFM_FLTxCR2(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x104UL + (flt) * 0x80UL))
#define SDFM_FLTxISR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x108UL + (flt) * 0x80UL))
#define SDFM_FLTxICR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x10CUL + (flt) * 0x80UL))

#define SDFM_FLTxJCHGR(flt)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x110UL + (flt) * 0x80UL))
#define SDFM_FLTxFCR(flt)    (*(__IO uint32_t *)(CM_SDFM_BASE + 0x114UL + (flt) * 0x80UL))
#define SDFM_FLTxJDATAR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x118UL + (flt) * 0x80UL))
#define SDFM_FLTxRDATAR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x11CUL + (flt) * 0x80UL))

#define SDFM_FLTxAWHTR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x120UL + (flt) * 0x80UL))
#define SDFM_FLTxAWLTR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x124UL + (flt) * 0x80UL))
#define SDFM_FLTxAWSR(flt)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x128UL + (flt) * 0x80UL))
#define SDFM_FLTxAWCFR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x12CUL + (flt) * 0x80UL))

#define SDFM_FLTxEXMAX(flt)   (*(__IO uint32_t *)(CM_SDFM_BASE + 0x130UL + (flt) * 0x80UL))
#define SDFM_FLTxEXMIN(flt)   (*(__IO uint32_t *)(CM_SDFM_BASE + 0x134UL + (flt) * 0x80UL))
#define SDFM_FLTxCNVTIMR(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x138UL + (flt) * 0x80UL))
#define SDFM_FLTxCNVTHRE(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x13CUL + (flt) * 0x80UL))

#define SDFM_FLTxFIFOCTL(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x140UL + (flt) * 0x80UL))
#define SDFM_FLTxDATFIFO(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x144UL + (flt) * 0x80UL))
#define SDFM_FLTxAWHTR2(flt)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x148UL + (flt) * 0x80UL))
#define SDFM_FLTxAWLTR2(flt)  (*(__IO uint32_t *)(CM_SDFM_BASE + 0x14CUL + (flt) * 0x80UL))

#define SDFM_FLTxCPARM(flt)     (*(__IO uint32_t *)(CM_SDFM_BASE + 0x150UL + (flt) * 0x80UL))
#define SDFM_FLTxEVTFITCTL(flt) (*(__IO uint32_t *)(CM_SDFM_BASE + 0x154UL + (flt) * 0x80UL))

/**
 * @}
 */

/**
 * @}
 */

