MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup SDFM_Global_Functions SDFM Global Functions
 * @{
 */

/**
 * @brief Initializes the specified SDFM channel according to the specified parameters
 *        in the structure pointed by pstcSdfmChInit.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  pstcSdfmChInit         Pointer to a @ref stc_sdfm_ch_init_t structure value that
 *        contains the configuration information for the SDFM channel.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcSdfmChInit == NULL
 * @note Some register bits can be modified only when CHyCFGR1.CHEN is zero.
 */
int32_t SDFM_CH_Init(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, const stc_sdfm_ch_init_t *pstcSdfmChInit)
{
    if (pstcSdfmChInit == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_INPUT_MUX(pstcSdfmChInit->u32InputMux));
    DDL_ASSERT(IS_SDFM_CH_DATA_PACKING(pstcSdfmChInit->u32DataPacking));
    DDL_ASSERT(IS_SDFM_CH_INPUT(pstcSdfmChInit->u32InputSel));

    DDL_ASSERT(IS_SDFM_CH_SERIAL_INTF_TYPE(pstcSdfmChInit->u32SerialIntfType));
    DDL_ASSERT(IS_SDFM_CH_SPI_CLK(pstcSdfmChInit->u32SpiClock));
    DDL_ASSERT(IS_SDFM_CH_CAL_OFFSET(pstcSdfmChInit->i32CalOffset));
    DDL_ASSERT(IS_SDFM_CH_RIGHT_BIT_SHIFT(pstcSdfmChInit->u32RightBitShift));

    DDL_ASSERT(IS_SDFM_CH_CLK_SEL(pstcSdfmChInit->u32ClockSel));
    DDL_ASSERT(IS_SDFM_CH_CLK_SYNC(pstcSdfmChInit->u32ClockSync));
    DDL_ASSERT(IS_SDFM_CH_DATA_SYNC(pstcSdfmChInit->u32DataSync));

    /* Set channel input parameters; Set serial interface parameters */
    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch),
                 SDFM_CHCFGR1_INIT_MASK,
                 (pstcSdfmChInit->u32InputMux | pstcSdfmChInit->u32DataPacking | pstcSdfmChInit->u32InputSel
                  | pstcSdfmChInit->u32SerialIntfType | pstcSdfmChInit->u32SpiClock | pstcSdfmChInit->u32ClockSync
                  | pstcSdfmChInit->u32DataSync | pstcSdfmChInit->u32ClockSel));

    /* Set channel offset and right bit shift */
    MODIFY_REG32(SDFM_CHyCFGR2(u32Ch),
                 SDFM_CHCFGR2_INIT_MASK,
                 ((uint32_t)pstcSdfmChInit->i32CalOffset << SDFM_CHCFGR2_OFFSET_POS)
                     | (pstcSdfmChInit->u32RightBitShift << SDFM_CHCFGR2_DTRBS_POS));

    WRITE_REG32(SDFM_CHyHLTZ(u32Ch), (uint16_t)pstcSdfmChInit->i16CrossZeroThreshold);

    return LL_OK;
}

/**
 * @brief Set each member of @ref stc_sdfm_ch_init_t to a default value.
 * @param [in]  pstcSdfmChInit        Pointer to a @ref stc_sdfm_ch_init_t structure
 *        whose members will be set to default values.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcSdfmChInit == NULL.
 */
int32_t SDFM_CH_StructInit(stc_sdfm_ch_init_t *pstcSdfmChInit)
{
    if (pstcSdfmChInit == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    /* Reset SDFM channel init structure parameters values */
    pstcSdfmChInit->u32InputMux       = SDFM_CH_INPUT_DATA_EXT;
    pstcSdfmChInit->u32DataPacking    = SDFM_CH_INPUT_DATA_PACKING_STD;
    pstcSdfmChInit->u32InputSel       = SDFM_CH_INPUT_PIN_SAME_CH_PIN;
    pstcSdfmChInit->u32SerialIntfType = SDFM_CH_SERIAL_INTF_SPI_RISING;
    pstcSdfmChInit->u32SpiClock       = SDFM_CH_SPI_CLK_EXT;
    pstcSdfmChInit->i32CalOffset      = 0;
    pstcSdfmChInit->u32RightBitShift  = 0U;

    pstcSdfmChInit->u32ClockSel  = SDFM_CH_CLK_SEL_SELF;
    pstcSdfmChInit->u32ClockSync = SDFM_CH_CLK_SYNC_DISABLE;
    pstcSdfmChInit->u32DataSync  = SDFM_CH_DATA_SYNC_DISABLE;

    pstcSdfmChInit->i16CrossZeroThreshold = 0;

    return LL_OK;
}

/**
 * @brief Enable/Disable SDFM channel.
 *        Once the channel is enabled, it receives serial data from the external sigma-delta modulator or
 *        parallel internal data sources (ADCs or CPU/DMA wire from memory).
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_CH_Cmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    __IO uint32_t *CHyCFGR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    CHyCFGR1 = &SDFM_CHyCFGR1(u32Ch);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*CHyCFGR1, SDFM_CHCFGR1_CHEN);
    }
    else
    {
        CLR_REG32_BIT(*CHyCFGR1, SDFM_CHCFGR1_CHEN);
    }
}

/**
 * @brief Initializes the specified SDFM filter according to the specified parameters
 *        in the structure pointed by pstcSdfmFilterInit.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  pstcSdfmFilterInit    Pointer to a @ref stc_sdfm_filter_init_t structure value that
 *        contains the configuration information for the SDFM filter.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcSdfmChInit == NULL
 * @note Some register bits can be modified only when FLTxCR1.DFEN is zero.
 */
int32_t SDFM_FILTER_Init(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, const stc_sdfm_filter_init_t *pstcSdfmFilterInit)
{
    if (pstcSdfmFilterInit == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

