MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    /* Parameters check */
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    DDL_ASSERT(IS_SDFM_CH(pstcSdfmFilterInit->stcReguConv.u32RegularCh));
    DDL_ASSERT(IS_SDFM_REGU_FAST_MD(pstcSdfmFilterInit->stcReguConv.u32FastMode));
    DDL_ASSERT(IS_SDFM_REGU_DMA(pstcSdfmFilterInit->stcReguConv.u32DmaRead));
    DDL_ASSERT(IS_SDFM_REGU_SYNC_START(pstcSdfmFilterInit->stcReguConv.u32SyncStart));
    DDL_ASSERT(IS_SDFM_REGU_CONT_MD(pstcSdfmFilterInit->stcReguConv.u32ContMode));

    DDL_ASSERT(IS_SDFM_INJ_EXT_TRIG(pstcSdfmFilterInit->stcInjConv.u32ExtTrigger));
    DDL_ASSERT(IS_SDFM_INJ_EXT_TRIG_EDGE(pstcSdfmFilterInit->stcInjConv.u32ExtTriggerEdge));
    DDL_ASSERT(IS_SDFM_INJ_DMA(pstcSdfmFilterInit->stcInjConv.u32DmaRead));
    DDL_ASSERT(IS_SDFM_INJ_SCAN_MD(pstcSdfmFilterInit->stcInjConv.u32ScanMode));
    DDL_ASSERT(IS_SDFM_INJ_SYNC_START(pstcSdfmFilterInit->stcInjConv.u32SyncStart));
    DDL_ASSERT(IS_SDFM_INJ_TYPE(pstcSdfmFilterInit->stcInjConv.u32Type));

    if (pstcSdfmFilterInit->stcInjConv.u32Type == SDFM_FILTER_INJ_TYPE_COMM)
    {
        DDL_ASSERT(IS_SDFM_MX_CH(pstcSdfmFilterInit->stcInjConv.u32InjectedCh));
    } /* else {
        NOTE: Injected FOFO mode use the regular channel.
        DDL_ASSERT(IS_SDFM_CH(pstcSdfmFilterInit->stcReguConv.u32RegularCh));
    } */

    DDL_ASSERT(IS_SDFM_FILTER_SINC_FOSR_ORDER(pstcSdfmFilterInit->stcSinc.u32SincFOSR,
                                              pstcSdfmFilterInit->stcSinc.u32SincOrder));
    DDL_ASSERT(IS_SDFM_FILTER_SINC_IOSR(pstcSdfmFilterInit->stcSinc.u32SincIOSR));

    DDL_ASSERT(IS_SDFM_FILTER_OVF_DEAL(pstcSdfmFilterInit->u32OvfDeal));

    /* Parameters configuration */
    /* Set regular conversion and injected conversion parameters */
    MODIFY_REG32(SDFM_FLTxCR1(u32Filter),
                 SDFM_FLTCR1_INIT_MASK,
                 pstcSdfmFilterInit->stcReguConv.u32FastMode
                     | (pstcSdfmFilterInit->stcReguConv.u32RegularCh << SDFM_FLTCR1_RCH_POS)
                     | pstcSdfmFilterInit->stcReguConv.u32DmaRead | pstcSdfmFilterInit->stcReguConv.u32SyncStart
                     | pstcSdfmFilterInit->stcReguConv.u32ContMode
                     | (pstcSdfmFilterInit->stcInjConv.u32ExtTrigger << SDFM_FLTCR1_JEXTSEL_POS)
                     | pstcSdfmFilterInit->stcInjConv.u32ExtTriggerEdge | pstcSdfmFilterInit->stcInjConv.u32DmaRead
                     | pstcSdfmFilterInit->stcInjConv.u32ScanMode | pstcSdfmFilterInit->stcInjConv.u32SyncStart
                     | pstcSdfmFilterInit->stcInjConv.u32Type | pstcSdfmFilterInit->u32OvfDeal);

    /* Set injected conversion channels */
    WRITE_REG32(SDFM_FLTxJCHGR(u32Filter), pstcSdfmFilterInit->stcInjConv.u32InjectedCh);

    /* Set filter control parameters */
    WRITE_REG32(SDFM_FLTxFCR(u32Filter),
                pstcSdfmFilterInit->stcSinc.u32SincOrder
                    | ((pstcSdfmFilterInit->stcSinc.u32SincFOSR - 1U) << SDFM_FLTFCR_FOSR_POS)
                    | (pstcSdfmFilterInit->stcSinc.u32SincIOSR - 1U));

    return LL_OK;
}

/**
 * @brief Set each member of @ref stc_sdfm_filter_init_t to a default value.
 * @param [in]  pstcSdfmFilterInit    Pointer to a @ref stc_sdfm_filter_init_t structure
 *        whose members will be set to default values.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcSdfmFilterInit == NULL.
 */
int32_t SDFM_FILTER_StructInit(stc_sdfm_filter_init_t *pstcSdfmFilterInit)
{
    if (pstcSdfmFilterInit == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    pstcSdfmFilterInit->stcReguConv.u32RegularCh = SDFM_CH0;
    pstcSdfmFilterInit->stcReguConv.u32FastMode  = SDFM_FILTER_REGU_FAST_MD_DISABLE;
    pstcSdfmFilterInit->stcReguConv.u32DmaRead   = SDFM_FILTER_REGU_DMA_DISABLE;
    pstcSdfmFilterInit->stcReguConv.u32SyncStart = SDFM_FILTER_REGU_SYNC_START_DISABLE;
    pstcSdfmFilterInit->stcReguConv.u32ContMode  = SDFM_FILTER_REGU_CONT_MD_DISABLE;

    pstcSdfmFilterInit->stcInjConv.u32InjectedCh     = SDFM_MX_CH0;
    pstcSdfmFilterInit->stcInjConv.u32ExtTrigger     = SDFM_FILTER_EXT_TRIG_JTRG0;
    pstcSdfmFilterInit->stcInjConv.u32ExtTriggerEdge = SDFM_FILTER_EXT_TRIG_DISABLE;
    pstcSdfmFilterInit->stcInjConv.u32DmaRead        = SDFM_FILTER_INJ_DMA_DISABLE;
    pstcSdfmFilterInit->stcInjConv.u32ScanMode       = SDFM_FILTER_INJ_SCAN_MD_DISABLE;
    pstcSdfmFilterInit->stcInjConv.u32SyncStart      = SDFM_FILTER_INJ_SYNC_START_DISABLE;
    pstcSdfmFilterInit->stcInjConv.u32Type           = SDFM_FILTER_INJ_TYPE_COMM;

    pstcSdfmFilterInit->stcSinc.u32SincOrder = SDFM_FILTER_SINC_ORDER_FASTSINC;
    pstcSdfmFilterInit->stcSinc.u32SincFOSR  = 1U;
    pstcSdfmFilterInit->stcSinc.u32SincIOSR  = 1U;

    pstcSdfmFilterInit->u32OvfDeal = SDFM_FILTER_OVF_CLAMPING;

    return LL_OK;
}

/**
 * @brief Enable/Disable the specified interrupts of the specified filter.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32FilterInt           The interrupts to be enabled/disabled.
 *        This parameter can be any combination of @ref SDFM_Filter_Int
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_FILTER_IntCmd(CM_SDFM_TypeDef *SDFMx,
                        uint32_t u32Filter,
                        uint32_t u32FilterInt,
                        en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR2;
    __IO uint32_t *FLTxCPARM;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_INT(u32FilterInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR2   = &SDFM_FLTxCR2(u32Filter);
    FLTxCPARM = &SDFM_FLTxCPARM(u32Filter);

    if (enNewState == ENABLE)
    {
        if ((u32FilterInt & SDFM_FILTER_INT_CH_CROSS_ZERO) != 0U)
        {
            SET_REG32_BIT(*FLTxCPARM, (1UL << SDFM_FLTCPARM_HZEN_POS));
        }
        SET_REG32_BIT(*FLTxCR2, u32FilterInt & (~SDFM_FILTER_INT_CH_CROSS_ZERO));
    }
    else
    {
        if ((u32FilterInt & SDFM_FILTER_INT_CH_CROSS_ZERO) != 0U)
        {
            CLR_REG32_BIT(*FLTxCPARM, (1UL << SDFM_FLTCPARM_HZEN_POS));
        }
        CLR_REG32_BIT(*FLTxCR2, u32FilterInt & (~SDFM_FILTER_INT_CH_CROSS_ZERO));
    }
}

/**
 * @brief Enable/Disable the specified channel interrupts for all FILTERs.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32ChInt               The channel interrupts to be enabled/disabled.
 *        This parameter can be any combination of @ref SDFM_Filter_Ch_Int
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_FILTER_ChIntCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32ChInt, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER_CH_INT(u32ChInt));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(SDFMx->FLT0CR2, u32ChInt);
    }
    else
    {
        CLR_REG32_BIT(SDFMx->FLT0CR2, u32ChInt);
    }
}

/**
 * @brief Enable/Disable the specified filter.
 *        Once FILTERx is enabled (DFEN=1), both Sinc digital filter unit and integrator unit are reinitialized.
 *        By clearing DFEN, any conversion which may be in progress is immediately stopped and FILTERx is put into stop mode.
 *        All register settings remain unchanged except SDFM_FLTxAWSR and SDFM_FLTxISR (which are reset).
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @arg DISABLE:                     SDFM_FLTx is disabled. All conversions of given SDFM_FLTx are stopped immediately
 *      and all SDFM_FLTx functions are stopped.
 *      Data which are cleared by setting DFEN = 0:
 *      - Register SDFM_FLTxISR is set to the reset state
 *      - Register SDFM_FLTxAWSR is set to the reset state
 * @arg ENABLE:                      SDFM_FLTx is enabled. If SDFM_FLTx is enabled, then SDFM_FLTx starts operating
 *      according to its setting.
 * @retval None
 */
void SDFM_FILTER_Cmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

