MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        /* Enable the filter */
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_DFEN);
    }
    else
    {
        /* Disable the filter */
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_DFEN);
    }
}

/**
 * @brief Global enable/disable for SDFM interface.
 *        SDFM must be globally disabled (by set CH0CFGR1.SDFMEN to zero) before
 *        stopping the system clock to enter in the STOP mode of the device.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @arg ENABLE:                      SDFM interface enabled.
 *      If SDFM interface is enabled, then it is started to operate according to
 *      enabled y channels and enabled x filters settings (CHEN bit in SDFM_CHyCFGR1
 *      and DFEN bit in SDFM_FLTxCR1).
 * @arg DISABLE:                     SDFM interface disabled.
 *      Data cleared by setting CH0CFGR1.SDFMEN to zero:
 *      - All registers SDFM_FLTxISR are set to reset state
 *      - All registers SDFM_FLTxAWSR are set to reset state
 * @retval None
 * @note SDFMEN is present only in SDFM_CH0CFGR1 register
 */
void SDFM_Cmd(CM_SDFM_TypeDef *SDFMx, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(SDFMx->CH0CFGR1, SDFM_CHCFGR1_SDFMEN);
    }
    else
    {
        CLR_REG32_BIT(SDFMx->CH0CFGR1, SDFM_CHCFGR1_SDFMEN);
    }
}

/**
 * @brief De-Initialize SDFM.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @retval int32_t:
 *         - LL_OK:                   De-Initialize success.
 *         - LL_ERR_TIMEOUT:          Timeout.
 */
int32_t SDFM_DeInit(CM_SDFM_TypeDef *SDFMx)
{
    __IO uint32_t u32TimeOut = 0U;

    /* Check FRST register protect */
    DDL_ASSERT((CM_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1);

    /* Reset */
    WRITE_REG32(bCM_RMU->FRST0_b.SDFM, 0UL);
    /* Ensure reset procedure is completed */

    while (READ_REG32(bCM_RMU->FRST0_b.SDFM) != 1UL)
    {
        u32TimeOut++;

        if (u32TimeOut > SDFM_RMU_TIMEOUT)
        {
            return LL_ERR_TIMEOUT;
        }
    }

    return LL_OK;
}

/***********************************************************************************************************************
 ***********************************************************************************************************************/
/**
 * @brief Configures output serial clock(Max 20MHz).
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32ClockOutSrc         Output serial clock source.
 *        This parameter can be a value of @ref SDFM_Ch_Output_Clk_Src
 * @param [in]  u32ClockOutDiv         Output serial clock divider.
 *        This parameter must be a number between 2 and 256.
 * @retval None
 * @note Calling this function will enable serial clock output.
 * @note These register bits can be modified only when CH0CFGR1.SDFMEN is zero.
 */
void SDFM_CH_ClockOutConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32ClockOutSrc, uint32_t u32ClockOutDiv)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH_CKOUT_SRC(u32ClockOutSrc));
    DDL_ASSERT(IS_SDFM_CH_CKOUT_DIV(u32ClockOutDiv));

    MODIFY_REG32(SDFMx->CH0CFGR1,
                 SDFM_CHCFGR1_CKOUTSRC | SDFM_CHCFGR1_CKOUTDIV,
                 u32ClockOutSrc | (u32ClockOutDiv - 1U) << SDFM_CHCFGR1_CKOUTDIV_POS);
}

/**
 * @brief Disable output serial clock.
 *        Output clock generation is disabled(CKOUT signal is set to low state).
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @retval None
 * @note These register bits can be modified only when CH0CFGR1.SDFMEN is zero.
 */
void SDFM_CH_DisableClockOut(CM_SDFM_TypeDef *SDFMx)
{
    DDL_ASSERT(IS_SDFM(SDFMx));

    CLR_REG32_BIT(SDFMx->CH0CFGR1, SDFM_CHCFGR1_CKOUTDIV);
}

/**
 * @brief Enable/Disable clock absence detector.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval int32_t:
 *         - LL_OK:                   Command success.
 *         - LL_ERR_TIMEOUT:          Timeout.
 */
int32_t SDFM_CH_ClockAbsenceDetectorCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t *CHyCFGR1;
    __IO uint32_t u32TimeOut = 0U;
    uint32_t u32CkabFlag = 1UL << (u32Ch + SDFM_FLTISR_CKABF_POS);

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    CHyCFGR1 = &SDFM_CHyCFGR1(u32Ch);

    if (enNewState == ENABLE)
    {
        while ((READ_REG32_BIT(SDFMx->FLT0ISR, u32CkabFlag)) != 0U)
        {
            WRITE_REG32(SDFMx->FLT0ICR, u32CkabFlag);
            u32TimeOut++;

            if (u32TimeOut > SDFM_CKAB_TIMEOUT)
            {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
        }

        if (i32Ret == LL_OK)
        {
            SET_REG32_BIT(*CHyCFGR1, SDFM_CHCFGR1_CKABEN);
        }
    }
    else
    {
        CLR_REG32_BIT(*CHyCFGR1, SDFM_CHCFGR1_CKABEN);
        WRITE_REG32(SDFMx->FLT0ICR, u32CkabFlag);
    }

    return i32Ret;
}

/**
 * @brief Configures short-circuit detector.
 *        Set threshold and break signals.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32Threshold           Short circuit detector threshold.
 *        This parameter must be a number between 0 and 255.
 * @param [in]  u32BreakSignal         Break signals assigned to short circuit event.
 *        This parameter can be any combination of @ref SDFM_Break_Signal
 *        BKSCD[i] = 0: Break i signal not assigned to short-circuit detector on the channel
 *        BKSCD[i] = 1: Break i signal assigned to short-circuit detector on the channel
 * @retval None
 */
void SDFM_CH_ShortCircuitDetectorConfig(CM_SDFM_TypeDef *SDFMx,
                                        uint32_t u32Ch,
                                        uint32_t u32Threshold,
                                        uint32_t u32BreakSignal)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_SCD_THRESHOLD(u32Threshold));
    DDL_ASSERT(IS_SDFM_BREAK_SIGNAL(u32BreakSignal));

    /* Configure threshold and break signals */
    MODIFY_REG32(SDFM_CHyAWSCDR(u32Ch),
                 SDFM_CHAWSCDR_BKSCD | SDFM_CHAWSCDR_SCDT,
                 (u32BreakSignal << SDFM_CHAWSCDR_BKSCD_POS) | u32Threshold);
}

/**
 * @brief Enable/Disable short-circuit detector.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_CH_ShortCircuitDetectorCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    __IO uint32_t *CHyCFGR1;

