MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));

    CHyCFGR1 = &SDFM_CHyCFGR1(u32Ch);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*CHyCFGR1, SDFM_CHCFGR1_SCDEN);
    }
    else
    {
        CLR_REG32_BIT(*CHyCFGR1, SDFM_CHCFGR1_SCDEN);
    }
}

/**
 * @brief Specifies input data multiplexer for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32InputMux            Input data multiplexer for the specified channel.
 *        This parameter can be a value of @ref SDFM_Ch_Input_Data_Mux
 * @retval None
 */
void SDFM_CH_SelectInputMux(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32InputMux)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_INPUT_MUX(u32InputMux));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_DATMPX, u32InputMux);
}

/**
 * @brief Specifies data packing mode in SDFM_CHyDATINR register.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32DataPacking         Data packing mode.
 *        This parameter can be a value of @ref SDFM_Ch_Input_Data_Packing
 * @retval None
 */
void SDFM_CH_SetDataPacking(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32DataPacking)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_DATA_PACKING(u32DataPacking));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_DATPACK, u32DataPacking);
}

/**
 * @brief Selects input pins for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32InputSel            Channel inputs selection.
 *        This parameter can be a value of @ref SDFM_Ch_Input
 * @retval None
 */
void SDFM_CH_SelectInput(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32InputSel)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_INPUT(u32InputSel));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_CHINSEL, u32InputSel);
}

/**
 * @brief Spepcifies serial interface type for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32IntfType            Serial interface type for the specified channel.
 *        This parameter can be a value of @ref SDFM_Ch_Serial_Intf_Type
 * @retval None
 */
void SDFM_CH_SetSerialIntfType(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32IntfType)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_SERIAL_INTF_TYPE(u32IntfType));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_SITP, u32IntfType);
}

/**
 * @brief Specifies SPI clock for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32SpiClk              SPI clock select for the specified channel.
 *        This parameter can be a value of @ref SDFM_Ch_SPI_Clk
 * @retval None
 */
void SDFM_CH_SetSpiClock(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32SpiClk)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_SPI_CLK(u32SpiClk));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_SPICKSEL, u32SpiClk);
}

/**
 * @brief Configures Analog watchdog for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32AwdSincOrder        Analog watchdog Sinc filter order.
          This parameter can be a value of @ref SDFM_Ch_Awd_Sinc_Order
 * @param [in]  u32AwdSincFOSR         Analog watchdog filter oversampling ratio (decimation rate).
          This parameter must be a number between 1 and 32
 * @retval None
 */
void SDFM_CH_AwdConfig(CM_SDFM_TypeDef *SDFMx,
                       uint32_t u32Ch,
                       uint32_t u32AwdSincOrder,
                       uint32_t u32AwdSincFOSR)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_AWD_SINC_ORDER(u32AwdSincOrder));
    DDL_ASSERT(IS_SDFM_CH_AWD_SINC_FOSR(u32AwdSincFOSR));

    MODIFY_REG32(SDFM_CHyAWSCDR(u32Ch),
                 (SDFM_CHAWSCDR_AWFOSR | SDFM_CHAWSCDR_AWFORD),
                 ((u32AwdSincFOSR - 1U) << SDFM_CHAWSCDR_AWFOSR_POS) | u32AwdSincOrder);
}

/**
 * @brief Get analog watchdog filter data of the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @retval Channel analog watchdog value.
 * @note Same mode has to be used for all channels
 */
int16_t SDFM_CH_GetAwdValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));

