MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    return (int16_t)SDFM_CHyWDATR(u32Ch);
}

/**
 * @brief Set calibration offset for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  i32CalOffset           Calibration offset value.
 *        This parameter must be a number between -8388608 and 8388607.
 * @retval None
 * @note Same mode has to be used for all channels
 */
void SDFM_CH_SetCalOffset(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, int32_t i32CalOffset)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_CAL_OFFSET(i32CalOffset));

    /* Modify channel offset */
    MODIFY_REG32(SDFM_CHyCFGR2(u32Ch), SDFM_CHCFGR2_OFFSET, ((uint32_t)i32CalOffset << SDFM_CHCFGR2_OFFSET_POS));
}

/**
 * @brief Write input data in standard mode.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  i16InputData           Input data (assigned to channel y)
 * @retval None
 */
void SDFM_CH_WriteInputDataStdMode(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, int16_t i16InputData)
{
    uint16_t u16Data = (uint16_t)i16InputData;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));

    WRITE_REG32(SDFM_CHyDATINR(u32Ch), u16Data);
}

/**
 * @brief Write input data in interleaved mode.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  i16FirstSample         First sample (assigned to channel y)
 * @param [in]  i16SecondSample        Second sample (assigned to channel y)
 * @retval None
 */
void SDFM_CH_WriteInputDataInterleavedMode(CM_SDFM_TypeDef *SDFMx,
                                           uint32_t u32Ch,
                                           int16_t i16FirstSample,
                                           int16_t i16SecondSample)
{
    uint16_t u16Data1 = (uint16_t)i16FirstSample;
    uint16_t u16Data2 = (uint16_t)i16SecondSample;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));

    WRITE_REG32(SDFM_CHyDATINR(u32Ch), ((uint32_t)u16Data2 << 16U) | u16Data1);
}

/**
 * @brief Write input data in dual mode.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  i16YSample             First sample (assigned to channel y)
 * @param [in]  i16Y1Sample            Second sample (assigned to channel y+1)
 * @retval None
 */
void SDFM_CH_WriteInputDataDualMode(CM_SDFM_TypeDef *SDFMx,
                                    uint32_t u32Ch,
                                    int16_t i16YSample,
                                    int16_t i16Y1Sample)
{
    uint16_t u16DataY  = (uint16_t)i16YSample;
    uint16_t u16DataY1 = (uint16_t)i16Y1Sample;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));

    WRITE_REG32(SDFM_CHyDATINR(u32Ch), ((uint32_t)u16DataY1 << 16U) | u16DataY);
}

/**
 * @brief Set delay for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u8Delay                Delay for the specified channel.
 *        This parameter must be a number between 0 and 63.
 * @retval None
 */
void SDFM_CH_SetDelay(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint8_t u8Delay)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_DELAY(u8Delay));

    WRITE_REG32(SDFM_CHyDLYR(u32Ch), u8Delay);
}

/**
 * @brief Select clock for the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  u32ClockSel            Clock selection.
 *        This parameter can be a value of @ref SDFM_Ch_Clk_Sel
 * @retval None
 */
void SDFM_CH_ClockSelect(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, uint32_t u32ClockSel)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_SDFM_CH_CLK_SEL(u32ClockSel));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_SDCLKSEL, u32ClockSel);
}

/**
 * @brief Enable/Disable clock synchronization of the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration type value.
 * @retval None
 */
void SDFM_CH_ClockSyncCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

