MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_SDCLKSYNC, (uint32_t)enNewState << SDFM_CHCFGR1_SDCLKSYNC_POS);
}

/**
 * @brief Enable/Disable data synchronization of the specified channel.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Ch                  SDFM channel.
 *        This parameter can be a value of @ref SDFM_Channel
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration type value.
 * @retval None
 */
void SDFM_CH_DataSyncCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Ch, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(SDFM_CHyCFGR1(u32Ch), SDFM_CHCFGR1_SDDATASYNC, (uint32_t)enNewState << SDFM_CHCFGR1_SDDATASYNC_POS);
}

/***********************************************************************************************************************
 ***********************************************************************************************************************/
/**
 * @brief Get the status of the specified filter flag.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32Flag                SDFM filter flag.
 *        This parameter can be any combination of @ref SDFM_Filter_Status_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDFM_FILTER_GetStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_FLAG(u32Flag));

    /* Return SET if one of the specified flags is SET. */
    return (en_flag_status_t)(READ_REG32_BIT(SDFM_FLTxISR(u32Filter), u32Flag) != 0U);
}

/**
 * @brief Get the status of the specified filter channel flag.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32ChFlag              SDFM filter channel flag.
 *        This parameter can be any combination of @ref SDFM_Filter_Ch_Status_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDFM_FILTER_GetChStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32ChFlag)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER_CH_FLAG(u32ChFlag));

    /* Clock absence flags and short-circuit detector flags are present only in SDFM_FLT0ISR register */
    /* Return SET if one of the specified flags is SET. */
    return (en_flag_status_t)(READ_REG32_BIT(SDFMx->FLT0ISR, u32ChFlag) != 0U);
}

/**
 * @brief Clear the specified filter flag.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32Flag                SDFM filter flag.
 *        This parameter can be any combination that included in
 *        SDFM_FILTER_FLAG_CLR_ALL of @ref SDFM_Filter_Status_Flag
 * @retval None
 */
void SDFM_FILTER_ClearStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_FLAG_CLR(u32Flag));

    /* Clear the selected flags */
    WRITE_REG32(SDFM_FLTxICR(u32Filter), u32Flag);
}

/**
 * @brief Clear the specified filter channel flag.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32ChFlag              SDFM filter channel flag.
 *        This parameter can be any combination that included in
 *        SDFM_FILTER_FLAG_CLR_ALL of @ref SDFM_Filter_Ch_Status_Flag
 * @retval int32_t:
 *         - LL_OK:                   Operation success.
 *         - LL_ERR_TIMEOUT:          Timeout.
 */
int32_t SDFM_FILTER_ClearChStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32ChFlag)
{
    int32_t i32Ret           = LL_OK;
    __IO uint32_t u32TimeOut = 0U;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER_CH_FLAG(u32ChFlag));

    /* Clock absence flags and short-circuit detector flags are present only in SDFM_FLT0ICR register */
    /* Clear the selected flags */

    while (1U)
    {
        WRITE_REG32(SDFMx->FLT0ICR, u32ChFlag);

        if ((READ_REG32_BIT(SDFMx->FLT0ISR, u32ChFlag)) == 0U)
        {
            break;
        }
        u32TimeOut++;

        if (u32TimeOut > SDFM_CKAB_TIMEOUT)
        {
            i32Ret = LL_ERR_TIMEOUT;
            break;
        }
    }

    return i32Ret;
}

/**
 * @brief Configures regular conversion.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  pstcRegu               Pointer to a @ref stc_sdfm_filter_regular_conv_t structure value that
 *        contains the configuration information for regular conversion.
 * @retval int32_t:
 *         - LL_OK:                   No errors occurred.
 *         - LL_ERR_INVD_PARAM:       pstcRegu == NULL.
 * @note Some register bits can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
int32_t SDFM_FILTER_RegularConvConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                      const stc_sdfm_filter_regular_conv_t *pstcRegu)
{
    if (pstcRegu == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

