MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    DDL_ASSERT(IS_SDFM_CH(pstcRegu->u32RegularCh));
    DDL_ASSERT(IS_SDFM_REGU_FAST_MD(pstcRegu->u32FastMode));
    DDL_ASSERT(IS_SDFM_REGU_DMA(pstcRegu->u32DmaRead));
    DDL_ASSERT(IS_SDFM_REGU_SYNC_START(pstcRegu->u32SyncStart));
    DDL_ASSERT(IS_SDFM_REGU_CONT_MD(pstcRegu->u32ContMode));

    /* Parameters configuration */
    /* Set regular conversion conversion parameters */
    MODIFY_REG32(SDFM_FLTxCR1(u32Filter),
                 SDFM_FLTCR1_REGU_CFG_MASK,
                 pstcRegu->u32FastMode | pstcRegu->u32DmaRead | pstcRegu->u32SyncStart | pstcRegu->u32ContMode
                     | (pstcRegu->u32RegularCh << SDFM_FLTCR1_RCH_POS));

    return LL_OK;
}

/**
 * @brief Enable/Disable continuous mode selection for regular conversions.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @arg DISABLE:                     Disable continuous mode selection for regular conversions.
 *      The regular channel is converted just once for each conversion request.
 * @arg ENABLE:                      Enable continuous mode selection for regular conversions.
 *      The regular channel is converted repeatedly after each conversion request.
 * @retval None
 * @note Disable continuous mode while a continuous regular conversion is already in progress stops the continuous
 *       mode immediately.
 */
void SDFM_FILTER_RegularConvContModeCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_RCONT, (uint32_t)enNewState << SDFM_FLTCR1_RCONT_POS);
}

/**
 * @brief Enable/Disable launch regular conversion synchronously with SDFM_FLT.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @arg DISABLE:                     Do not launch a regular conversion synchronously with SDFM_FLT.
 * @arg ENABLE:                      Launch a regular conversion in this SDFM_FLTx(x > 0) at the very moment when a
 *      regular conversion is launched in SDFM_FLT.
 * @retval None
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_RegularConvSyncStartCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_SYNC_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_RSYNC);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_RSYNC);
    }
}

/**
 * @brief Enable/Disable DMA channel enabled to read data for the regular conversion.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_RegularConvDmaReadCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_SYNC_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_RDMAEN);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_RDMAEN);
    }
}

/**
 * @brief Enable/Disable fast conversion mode selection for regular conversions.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note When converting a regular conversion in continuous mode, having enabled the fast mode causes each conversion
 *       (except the first) to execute faster than in standard mode. This bit has no effect on conversions which are
 *       not continuous.
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_RegularConvFastModeCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_SYNC_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_FAST);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_FAST);
    }
}

/**
 * @brief Set one channel for regular conversion.
 *        Calling this function when RCIP=1 takes effect when the next regular conversion begins. This is especially
 *        useful in continuous mode (when RCONT=1). It also affects regular conversions which are pending (due to
 *        ongoing injected conversion).
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32ReguCh              Channel for regular conversion.
 *        This parameter can be a value of @ref SDFM_Channel
 * @retval None
 */
void SDFM_FILTER_SetRegularConvCh(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32ReguCh)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_CH(u32ReguCh));

    MODIFY_REG32(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_RCH, u32ReguCh << SDFM_FLTCR1_RCH_POS);
}

/**
 * @brief Software start a regular conversion on the specified SDFM filter.
 *        Call this function to make a request to start a conversion on the regular channel and causes RCIP to become '1'.
 *        If RCIP=1 already or RSYNC=1, calling this function has no effect.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval None
 */
void SDFM_FILTER_StartRegularConv(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    SET_REG32_BIT(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_RSWSTART);
}

/**
 * @brief Get regular conversion value.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [out] pu32Ch                 Pointer to an uint32_t type address to store corresponding channel of regular conversion.
 *        The output value can be a value of @ref SDFM_Channel
 * @retval Regular conversion value.
 */
int32_t SDFM_FILTER_GetRegularConvValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch)
{
    uint32_t u32Reg;
    int32_t i32Value;

