MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    u32Reg = SDFM_FLTxRDATAR(u32Filter);

    /* Extract channel and regular conversion value */

    if (pu32Ch != NULL)
    {
        *pu32Ch = u32Reg & SDFM_FLTRDATAR_RDATACH;
    }
    /* Regular conversion value is a signed value located on 24 MSB of register */
    /* So after applying a mask on these bits we have to perform a division by 256 (2 raised to the power of 8) */
    u32Reg &= SDFM_FLTRDATAR_RDATA;
    i32Value = (int32_t)u32Reg / 256;

    return i32Value;
}

/**
 * @brief Configures injected conversion.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  pstcInj                Pointer to a @ref stc_sdfm_filter_injected_conv_t structure value that
 *        contains the configuration information for injected conversion.
 * @retval int32_t:
 *         - LL_OK:                   No errors occurred.
 *         - LL_ERR_INVD_PARAM:       pstcInj == NULL.
 * @note Some register bits can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
int32_t SDFM_FILTER_InjectedConvConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                                       const stc_sdfm_filter_injected_conv_t *pstcInj)
{
    if (pstcInj == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    /* Parameters check */
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    DDL_ASSERT(IS_SDFM_MX_CH(pstcInj->u32InjectedCh));
    DDL_ASSERT(IS_SDFM_INJ_EXT_TRIG(pstcInj->u32ExtTrigger));
    DDL_ASSERT(IS_SDFM_INJ_EXT_TRIG_EDGE(pstcInj->u32ExtTriggerEdge));
    DDL_ASSERT(IS_SDFM_INJ_DMA(pstcInj->u32DmaRead));
    DDL_ASSERT(IS_SDFM_INJ_SCAN_MD(pstcInj->u32ScanMode));
    DDL_ASSERT(IS_SDFM_INJ_SYNC_START(pstcInj->u32SyncStart));
    DDL_ASSERT(IS_SDFM_INJ_TYPE(pstcInj->u32Type));

    /* Parameters configuration */
    /* Set injected conversion parameters */
    MODIFY_REG32(SDFM_FLTxCR1(u32Filter),
                 SDFM_FLTCR1_INJ_CFG_MASK,
                 pstcInj->u32DmaRead | pstcInj->u32ScanMode | pstcInj->u32SyncStart | pstcInj->u32ExtTriggerEdge
                     | pstcInj->u32Type | (pstcInj->u32ExtTrigger << SDFM_FLTCR1_JEXTSEL_POS));

    /* Set injected conversion channels */
    WRITE_REG32(SDFM_FLTxJCHGR(u32Filter), pstcInj->u32InjectedCh);

    return LL_OK;
}

/**
 * @brief Enable/Disable launch injected conversion synchronously with SDFM_FLT.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @arg DISABLE:                 Do not launch an injected conversion synchronously with SDFM_FLT.
 * @arg ENABLE:                  Launch an injected conversion in this SDFM_FLTx at the very moment when an injected
 *      conversion is launched in SDFM_FLT by its JSWSTART trigger.
 * @retval None
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_InjectedConvSyncStartCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_JSYNC);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_JSYNC);
    }
}

/**
 * @brief Enable/Disable injected conversion scan mode.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @arg DISABLE:                     Disable scanning mode.
 *      Only one channel is converted from the selected channels(SDFM_FLTxJCHGR.JCHG),
 *      and the channel selection is moved to the next channel.
 * @arg ENABLE:                      Enable scanning mode.
 *      Each of the selected channels(SDFM_FLTxJCHGR.JCHG) is converted, one after another.
 *      The lowest channel (channel 0, if selected) is converted first and the sequence
 *      ends at the highest selected channel
 * @retval None
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_InjectedConvScanModeCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_JSCAN);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_JSCAN);
    }
}

/**
 * @brief Enable/Disable DMA channel enabled to read data for the injected channel group.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_InjectedConvDmaReadCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR1;

