MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_SYNC_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_JDMAEN);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR1, SDFM_FLTCR1_JDMAEN);
    }
}

/**
 * @brief Set injected conversion type.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32InjType             Injected Conversion type.
 *        This parameter can be a value of @ref SDFM_Filter_Inj_Type
 * @retval None
 * @note This register bit can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_SetInjectedConvType(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32InjType)
{
    __IO uint32_t *FLTxCR1;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_INJ_TYPE(u32InjType));

    FLTxCR1 = &SDFM_FLTxCR1(u32Filter);
    MODIFY_REG32(*FLTxCR1, SDFM_FLTCR1_JSCAN_TYPE, u32InjType);
}

/**
 * @brief Set external trigger for injected conversion.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32ExtTrigger          Trigger signal selection for launching injected conversions.
 *        This parameter can be a value of @ref SDFM_Filter_Ext_Trigger
 * @param [in]  u32ExtTriggerEdge      Trigger enable and trigger edge selection for injected conversions.
 *        External trigger edge: rising, falling or both
 *        This parameter can be a value of @ref SDFM_Filter_Ext_Trigger_Edge
 * @retval None
 * @note These register bits can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
void SDFM_FILTER_SetInjectedConvExtTrigger(CM_SDFM_TypeDef *SDFMx,
                                           uint32_t u32Filter,
                                           uint32_t u32ExtTrigger,
                                           uint32_t u32ExtTriggerEdge)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_INJ_EXT_TRIG(u32ExtTrigger));
    DDL_ASSERT(IS_SDFM_INJ_EXT_TRIG_EDGE(u32ExtTriggerEdge));

    MODIFY_REG32(SDFM_FLTxCR1(u32Filter),
                 (SDFM_FLTCR1_JEXTSEL | SDFM_FLTCR1_JEXTEN),
                 (u32ExtTrigger << SDFM_FLTCR1_JEXTSEL_POS) | u32ExtTriggerEdge);
}

/**
 * @brief Set channels for injected conversion.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32InjCh               Channels for injected conversion.
 *        This parameter can be any combination of @ref SDFM_Channel_Mult
 * @retval None
 * @note Writing JCHG, if JSCAN=0, resets the channel selection to the lowest selected channel.
 * @note At least one channel must always be selected for the injected group. Writes causing all JCHG bits to be zero
 *       are ignored.
 */
void SDFM_FILTER_SetInjectedConvCh(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32InjCh)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_MX_CH(u32InjCh));

    WRITE_REG32(SDFM_FLTxJCHGR(u32Filter), u32InjCh);
}

/**
 * @brief Software start an injected conversion on the specified SDFM filter.
 *
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval None
 */
void SDFM_FILTER_StartInjectedConv(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    SET_REG32_BIT(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_JSWSTART);
}

/**
 * @brief Get injected conversion value.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [out] pu32Ch                 Pointer to an uint32_t type address to store corresponding channel of injected conversion.
 *        The output value can be a value of @ref SDFM_Channel
 * @retval Injected conversion value
 */
int32_t SDFM_FILTER_GetInjectedConvValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch)
{
    uint32_t u32Reg;
    int32_t i32Value;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    u32Reg = SDFM_FLTxJDATAR(u32Filter);

    /* Extract channel and injected conversion value */

    if (pu32Ch != NULL)
    {
        *pu32Ch = u32Reg & SDFM_FLTJDATAR_JDATACH;
    }
    /* Injected conversion value is a signed value located on 24 MSB of register */
    /* So after applying a mask on these bits we have to perform a division by 256 (2 raised to the power of 8) */
    u32Reg &= SDFM_FLTJDATAR_JDATA;
    i32Value = (int32_t)u32Reg / 256;

    return i32Value;
}

/***********************************************************************************************************************
 ***********************************************************************************************************************/
/**
 * @brief Configures the FIFO of the specified SDFM filter according to the specified parameters
 *        in the structure pointed by pstcFifo.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  pstcFifo               Pointer to a @ref stc_sdfm_filter_fifo_config_t structure value that
 *        contains the configuration information for the FIFO of SDFM filter.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcFifo == NULL.
 * @note Some register bits can be modified only when SDFM_FLT0CR1.DFEN is zero.
 * @note The FIFO need to be configured only when FIFO injected conversion used(FLTxCR1.JSCAN_TYPE = 1).
 */
int32_t SDFM_FILTER_FifoConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter,
                               const stc_sdfm_filter_fifo_config_t *pstcFifo)
{
    if (pstcFifo == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

