MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    /* Parameters check */
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    DDL_ASSERT(IS_SDFM_FILTER_FIFO_INT_LEVEL(pstcFifo->u32IntLevel));
    DDL_ASSERT(IS_SDFM_FILTER_FIFO_WAIT_FOR_SYNC(pstcFifo->u32WaitForSync));
    DDL_ASSERT(IS_SDFM_FILTER_FIFO_CLR_ON_SYNC(pstcFifo->u32ClearOnSync));
    DDL_ASSERT(IS_SDFM_FILTER_FIFO_FLAG_CLR_ON_INT(pstcFifo->u32FlagClearOnInt));

    MODIFY_REG32(SDFM_FLTxFIFOCTL(u32Filter),
                 SDFM_FLTFIFOCTL_INIT_MASK,
                 pstcFifo->u32IntLevel | pstcFifo->u32WaitForSync | pstcFifo->u32ClearOnSync
                     | pstcFifo->u32FlagClearOnInt);

    return LL_OK;
}

/**
 * @brief Set each member of @ref stc_sdfm_filter_fifo_config_t to a default value.
 * @param [in]  pstcFifo               Pointer to a @ref stc_sdfm_filter_fifo_config_t structure
 *        whose members will be set to default values.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcFifo == NULL.
 */
int32_t SDFM_FILTER_FifoStructInit(stc_sdfm_filter_fifo_config_t *pstcFifo)
{
    if (pstcFifo == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    pstcFifo->u32IntLevel       = 0U;
    pstcFifo->u32WaitForSync    = SDFM_FILTER_FIFO_WAIT_FOR_SYNC_DISABLE;
    pstcFifo->u32ClearOnSync    = SDFM_FILTER_FIFO_CLR_ON_SYNC_DISABLE;
    pstcFifo->u32FlagClearOnInt = SDFM_FILTER_FIFO_FLAG_CLR_ON_INT_DISABLE;

    return LL_OK;
}

/**
 * @brief Get FIFO status.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval The number of word(s) in the FIFO. 0 indicates the FIFO is empty.
 */
uint32_t SDFM_FILTER_GetFifoStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    return (READ_REG32_BIT(SDFM_FLTxFIFOCTL(u32Filter), SDFM_FLTFIFOCTL_SDFFST) >> SDFM_FLTFIFOCTL_SDFFST_POS);
}

/**
 * @brief Read FIFO data.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [out] pu32Ch                 Pointer to an uint32_t type address to store corresponding channel of injected conversion.
 *        The output value can be a value of @ref SDFM_Channel
 * @retval An uint32_t type value:
 */
int32_t SDFM_FILTER_ReadFifo(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch)
{
    uint32_t u32Reg;
    int32_t i32Value;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    u32Reg = SDFM_FLTxDATFIFO(u32Filter);

    /* Extract channel and injected conversion value */

    if (pu32Ch != NULL)
    {
        *pu32Ch = u32Reg & SDFM_FLTDATFIFO_FIFO_JDATACH;
    }
    /* Injected conversion value is a signed value located on 24 MSB of register */
    /* So after applying a mask on these bits we have to perform a division by 256 (2 raised to the power of 8) */
    u32Reg &= SDFM_FLTDATFIFO_FIFO_JDATA;
    i32Value = (int32_t)u32Reg / 256;

    return i32Value;
}

/**
 * @brief Get the status of the FIFO flag bit.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32FifoFlag            FIFO flag bit.
 *        This parameter can be a value of @ref SDFM_Filter_Fifo_Flag
 * @retval An en_flag_status_t type value:
 *         - SET: The status of the flag bit is SET.
 *         - RESET: The status of the flag bit is NOT SET.
 */
en_flag_status_t SDFM_FILTER_GetFifoFlagStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32FifoFlag)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_FIFO_FLAG(u32FifoFlag));

    return (en_flag_status_t)(READ_REG32_BIT(SDFM_FLTxFIFOCTL(u32Filter), u32FifoFlag) != 0U);
}

/**
 * @brief Clear the status of the FIFO flag bit.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32FifoFlag            FIFO flag bit.
 *        This parameter can be a value of @ref SDFM_Filter_Fifo_Flag
 * @retval None
 */
void SDFM_FILTER_ClearFifoFlagStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32FifoFlag)
{
    uint32_t u32RegVal;
    __IO uint32_t *FLTxFIFOCTL;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_FIFO_FLAG(u32FifoFlag));

    FLTxFIFOCTL = &SDFM_FLTxFIFOCTL(u32Filter);
    u32RegVal   = READ_REG32(*FLTxFIFOCTL);
    u32RegVal &= ~(SDFM_FILTER_FIFO_FLAG_ALL);
    u32RegVal |= u32FifoFlag;

    WRITE_REG32(*FLTxFIFOCTL, u32RegVal);
}

/***********************************************************************************************************************
 ***********************************************************************************************************************/
/**
 * @brief Configures the Cevt of the specified SDFM filter according to the specified parameters
 *        in the structure pointed by pstcCevt.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32Cevt                Cevt.
 *        This parameter can be a value of @ref SDFM_Filter_Cevt
 * @param [in]  pstcCevt               Pointer to a @ref stc_sdfm_filter_cevt_config_t structure value that
 *        contains the configuration information for the Cevt of SDFM filter.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcCevt == NULL.
 * @note Some register bits can be modified only when SDFM_FLT0CR1.DFEN is zero.
 */
int32_t SDFM_FILTER_CevtConfig(CM_SDFM_TypeDef *SDFMx,
                               uint32_t u32Filter,
                               uint32_t u32Cevt,
                               const stc_sdfm_filter_cevt_config_t *pstcCevt)
{
    uint32_t u32CfgVal;
    uint32_t u32Mask;

    if (pstcCevt == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

