MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    /* Parameters check */
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_CEVT(u32Cevt));

    DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcCevt->enIntState));
    DDL_ASSERT(IS_SDFM_FILTER_CEVT_INPUT(pstcCevt->u32InputSel));
    DDL_ASSERT(IS_SDFM_FILTER_CEVT_OUTPUT(pstcCevt->u32OutputSel));
    DDL_ASSERT(IS_SDFM_FILTER_CEVT_DF_SPL_WINDOW(pstcCevt->u32SampleWindow));
    DDL_ASSERT(IS_SDFM_FILTER_CEVT_DF_VOTING_THRESHOLD(pstcCevt->u32VotingThreshold));

    u32CfgVal = (pstcCevt->u32VotingThreshold << SDFM_FLTEVTFITCTL_THRESH1_POS) | (pstcCevt->u32SampleWindow - 1U);
    u32CfgVal <<= (SDFM_FLTEVTFITCTL_SAMPWIN2_POS * u32Cevt);
    u32Mask = SDFM_FLTEVTFLTCTL_INIT_MASK << (SDFM_FLTEVTFITCTL_SAMPWIN2_POS * u32Cevt);
    MODIFY_REG32(SDFM_FLTxEVTFITCTL(u32Filter), u32Mask, u32CfgVal);

    u32CfgVal = (uint32_t)pstcCevt->enIntState << u32Cevt;
    u32Mask   = 1UL << u32Cevt;

    if (u32Cevt == SDFM_FILTER_CEVT1)
    {
        u32CfgVal |= pstcCevt->u32InputSel << SDFM_FLTCPARM_CEVT1SEL_POS;
        u32CfgVal |= pstcCevt->u32OutputSel << SDFM_FLTCPARM_CEVT1DIGFILTSEL_POS;
        u32Mask |= (SDFM_FLTCPARM_CEVT1SEL | SDFM_FLTCPARM_CEVT1DIGFILTSEL);
    }
    else
    {
        u32CfgVal |= pstcCevt->u32InputSel << SDFM_FLTCPARM_CEVT2SEL_POS;
        u32CfgVal |= pstcCevt->u32OutputSel << SDFM_FLTCPARM_CEVT2DIGFILTSEL_POS;
        u32Mask |= (SDFM_FLTCPARM_CEVT2SEL | SDFM_FLTCPARM_CEVT2DIGFILTSEL);
    }
    MODIFY_REG32(SDFM_FLTxCPARM(u32Filter), u32Mask, u32CfgVal);

    return LL_OK;
}

/**
 * @brief Set each member of @ref stc_sdfm_filter_cevt_config_t to a default value.
 * @param [in]  pstcCevt               Pointer to a @ref stc_sdfm_filter_cevt_config_t structure
 *        whose members will be set to default values.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcCevt == NULL.
 */
int32_t SDFM_FILTER_CevtStructInit(stc_sdfm_filter_cevt_config_t *pstcCevt)
{
    if (pstcCevt == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    pstcCevt->enIntState         = DISABLE;
    pstcCevt->u32InputSel        = 0U;
    pstcCevt->u32SampleWindow    = 1U;
    pstcCevt->u32VotingThreshold = 0U;
    pstcCevt->u32OutputSel       = SDFM_FILTER_CEVT_OUTPUT_RAW;

    return LL_OK;
}

/**
 * @brief Reset the digital filter FIFO of high filter(for CEVT1) and low filter(for CEVT2) to zero.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval None
 */
void SDFM_FILTER_ResetCevtDigitalFifo(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    SET_REG32_BIT(SDFM_FLTxCPARM(u32Filter), SDFM_FLTCPARM_FILINIT);
}

/**
 * @brief Set the channel that it's COMPL1/2 and COMPH1/2 pass through the digital filter core of CEVT1 and CEVT2.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32Ch                  Channel for digital filter.
 *        This parameter can be a value of @ref SDFM_Channel
 * @retval None
 */
void SDFM_FILTER_CevtDigitalFilterSetInputCh(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Ch)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_MX_CH(u32Ch));

    MODIFY_REG32(SDFM_FLTxCPARM(u32Filter), SDFM_FLTCPARM_FILTER_CH, u32Ch << SDFM_FLTCPARM_FILTER_CH_POS);
}

/**
 * @brief Enable/Disable the digital filter core of CEVT1 and CEVT2.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_FILTER_CevtDigitalFilterCmd(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    MODIFY_REG32(SDFM_FLTxCPARM(u32Filter),
                 SDFM_FLTCPARM_CEVFILTER_EN,
                 (uint32_t)enNewState << SDFM_FLTCPARM_CEVFILTER_EN_POS);
}

/**
 * @brief Enable/Disable channels for extremes detector.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32ExtrCh              Channels for extremes detector.
 *        This parameter can be any combination of @ref SDFM_Channel_Mult
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_FILTER_ExtremesChCmd(CM_SDFM_TypeDef *SDFMx,
                               uint32_t u32Filter,
                               uint32_t u32ExtrCh,
                               en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR2;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_MX_CH(u32ExtrCh));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR2 = &SDFM_FLTxCR2(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR2, u32ExtrCh << SDFM_FLTCR2_EXCH_POS);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR2, u32ExtrCh << SDFM_FLTCR2_EXCH_POS);
    }
}

/**
 * @brief Reset(Stop) extreme detector feature.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval None
 */
void SDFM_FILTER_ResetExtremes(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    __IO uint32_t u32Data1;
    __IO uint32_t u32Data2;

