MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    /* Reset channels for extreme detector */
    CLR_REG32_BIT(SDFM_FLTxCR2(u32Filter), SDFM_FLTCR2_EXCH);
    /* Clear extreme detector values */
    u32Data1 = SDFM_FLTxEXMAX(u32Filter);
    u32Data2 = SDFM_FLTxEXMIN(u32Filter);
    (void)u32Data1;
    (void)u32Data2;
}

/**
 * @brief Get extremes detector maximum value.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [out] pu32Ch                 Corresponding channel of extremes detector maximum value.
 *        This parameter can be a value of @ref SDFM_Channel
 * @retval Extremes detector maximum value. This value is between -8388608 and 8388607.
 */
int32_t SDFM_FILTER_GetExtremeMaxValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch)
{
    uint32_t u32Reg;
    int32_t i32Value;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    u32Reg = SDFM_FLTxEXMAX(u32Filter);

    /* Extract channel and extremes detector maximum value */

    if (pu32Ch != NULL)
    {
        *pu32Ch = u32Reg & SDFM_FLTEXMAX_EXMAXCHCH;
    }
    /* Extremes detector maximum value is a signed value located on 24 MSB of register */
    /* So after applying a mask on these bits we have to perform a division by 256 (2 raised to the power of 8) */
    u32Reg &= SDFM_FLTEXMAX_EXMAX;
    i32Value = (int32_t)u32Reg / 256;

    return i32Value;
}

/**
 * @brief Get extremes detector minimum value.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [out] pu32Ch                 Corresponding channel of extremes detector minimum value.
 *        This parameter can be a value of @ref SDFM_Channel
 * @retval Extremes detector minimum value. This value is between -8388608 and 8388607.
 */
int32_t SDFM_FILTER_GetExtremeMinValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t *pu32Ch)
{
    uint32_t u32Reg;
    int32_t i32Value;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    u32Reg = SDFM_FLTxEXMIN(u32Filter);

    /* Extract channel and extremes detector minimum value */

    if (pu32Ch != NULL)
    {
        *pu32Ch = u32Reg & SDFM_FLTEXMIN_EXMINCHCH;
    }
    /* Extremes detector minimum value is a signed value located on 24 MSB of register */
    /* So after applying a mask on these bits we have to perform a division by 256 (2 raised to the power of 8) */
    u32Reg &= SDFM_FLTEXMIN_EXMIN;
    i32Value = (int32_t)u32Reg / 256;

    return i32Value;
}

/**
 * @brief Get conversion time value.
 *        28-bit timer counting conversion time t = CNVTIMR[27:0] / (fSDFMCLK*CNVTHRE)
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval Conversion time value.
 */
uint32_t SDFM_FILTER_GetConvTimeValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    return (READ_REG32_BIT(SDFM_FLTxCNVTIMR(u32Filter), SDFM_FLTCNVTIMR_CNVCNT) >> SDFM_FLTCNVTIMR_CNVCNT_POS);
}

/**
 * @brief Get converter thre value.
 * @brief 28-bit timer counting conversion time t = CNVTIMR[27:0] / (fSDFMCLK*CNVTHRE)
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @retval Converter thre value, a value between 1 and 36.
 */
uint32_t SDFM_FILTER_GetConvThreValue(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    return READ_REG32_BIT(SDFM_FLTxCNVTHRE(u32Filter), SDFM_FLTCNVTHRE_CNVTHRE);
}

/**
 * @brief Configures filter analog watchdog.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  pstcAwd                Pointer to a @ref stc_sdfm_filter_awd_t structure value that
 *        contains the configuration information of the AWD.
 * @retval int32_t:
 *         - LL_OK:                   No errors occurred.
 *         - LL_ERR_INVD_PARAM:       pstcAwd == NULL.
 */
int32_t SDFM_FILTER_AwdConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, const stc_sdfm_filter_awd_t *pstcAwd)
{
    int32_t i32HighThreshold;
    int32_t i32LowThreshold;

    if (pstcAwd == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    i32HighThreshold = pstcAwd->i32HighThreshold;
    i32LowThreshold  = pstcAwd->i32LowThreshold;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_DATA_SRC(pstcAwd->u32DataSrc));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_THRESHOLD(i32HighThreshold));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_THRESHOLD(i32LowThreshold));
    DDL_ASSERT(IS_SDFM_BREAK_SIGNAL(pstcAwd->u32HighBreakSignal));
    DDL_ASSERT(IS_SDFM_BREAK_SIGNAL(pstcAwd->u32LowBreakSignal));

    if (pstcAwd->u32DataSrc == SDFM_FILTER_AWD_CH_DATA)
    {
        i32HighThreshold *= 256;
        i32LowThreshold *= 256;
    }
    /* Set analog watchdog data source */
    MODIFY_REG32(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_AWFSEL, pstcAwd->u32DataSrc);
    /* Set thresholds and break signals */
    MODIFY_REG32(SDFM_FLTxAWHTR(u32Filter),
                 (SDFM_FLTAWHTR_AWHT | SDFM_FLTAWHTR_BKAWH),
                 ((uint32_t)i32HighThreshold << SDFM_FLTAWHTR_AWHT_POS) | pstcAwd->u32HighBreakSignal);
    MODIFY_REG32(SDFM_FLTxAWLTR(u32Filter),
                 (SDFM_FLTAWLTR_AWLT | SDFM_FLTAWLTR_BKAWL),
                 ((uint32_t)i32LowThreshold << SDFM_FLTAWLTR_AWLT_POS) | pstcAwd->u32LowBreakSignal);

    /* Set analog watchdog thresholds2 */
    WRITE_REG32(SDFM_FLTxAWHTR2(u32Filter), ((uint32_t)pstcAwd->i16HighThreshold2 << SDFM_FLTAWHT2_AWHT2_POS));
    WRITE_REG32(SDFM_FLTxAWLTR2(u32Filter), ((uint32_t)pstcAwd->i16LowThreshold2 << SDFM_FLTAWLT2_AWLT2_POS));

