MAXLII/ATOMAN/platform/hc32f558/Firmware/HC32_LL_Driver/src/hc32_ll_sdfm.c
    /* Break signal assignment to cross zero event.
       In case of input channels monitoring (AWFSEL=1), the data for comparison to threshold is taken from channels
       selected by AWDCH[7:0] field (SDFM_FLTxCR2 register). Each of the selected channels filter result is compared
       to zero, generate cross zero break. */
    MODIFY_REG32(SDFM_FLTxCPARM(u32Filter),
                 SDFM_FLTCPARM_BK_CROSS_ZERO,
                 pstcAwd->u32CrossZeroBreakSignal << SDFM_FLTCPARM_BK_CROSS_ZERO_POS);

    return LL_OK;
}

/**
 * @brief Set each member of @ref stc_sdfm_filter_awd_t to a default value.
 * @param [in]  pstcAwd                Pointer to a @ref stc_sdfm_filter_awd_t structure
 *        whose members will be set to default values.
 * @retval int32_t:
 *         - LL_OK:                   No error occurred.
 *         - LL_ERR_INVD_PARAM:       pstcAwd == NULL.
 */
int32_t SDFM_FILTER_AwdStructInit(stc_sdfm_filter_awd_t *pstcAwd)
{
    if (pstcAwd == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }
    pstcAwd->u32DataSrc              = SDFM_FILTER_AWD_FILTER_DATA;
    pstcAwd->i32HighThreshold        = 0;
    pstcAwd->i32LowThreshold         = 0;
    pstcAwd->i16HighThreshold2       = 0;
    pstcAwd->i16LowThreshold2        = 0;
    pstcAwd->u32HighBreakSignal      = SDFM_BREAK_SIGNAL_NONE;
    pstcAwd->u32LowBreakSignal       = SDFM_BREAK_SIGNAL_NONE;
    pstcAwd->u32CrossZeroBreakSignal = SDFM_BREAK_SIGNAL_NONE;

    return LL_OK;
}

/**
 * @brief Enable/Disable channels for analog watchdog.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32AwdCh               Channels for analog watchdog.
 *        This parameter can be any combination of @ref SDFM_Channel_Mult
 * @param [in]  enNewState             An @ref en_functional_state_t enumeration value.
 * @retval None
 */
void SDFM_FILTER_AwdChCmd(CM_SDFM_TypeDef *SDFMx,
                          uint32_t u32Filter,
                          uint32_t u32AwdCh,
                          en_functional_state_t enNewState)
{
    __IO uint32_t *FLTxCR2;

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_MX_CH(u32AwdCh));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    FLTxCR2 = &SDFM_FLTxCR2(u32Filter);

    if (enNewState == ENABLE)
    {
        SET_REG32_BIT(*FLTxCR2, u32AwdCh << SDFM_FLTCR2_AWDCH_POS);
    }
    else
    {
        CLR_REG32_BIT(*FLTxCR2, u32AwdCh << SDFM_FLTCR2_AWDCH_POS);
    }
}

/**
 * @brief Set analog watchdog data source.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32DataSrc             Analog watchdog data source.
 *        Values from digital filter or from channel watchdog filter.
 *        This parameter can be a value of @ref SDFM_Filter_Awd_Data_Src
 * @retval None
 */
void SDFM_FILTER_SetAwdDataSrc(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32DataSrc)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_DATA_SRC(u32DataSrc));

    /* Set analog watchdog data source */
    MODIFY_REG32(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_AWFSEL, u32DataSrc);
}

/**
 * @brief Set analog watchdog high/low threshold.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  i32HighThreshold       Analog watchdog high threshold.
 *        This parameter must be a number between -8388608 and 8388607
 * @param [in]  i32LowThreshold        Analog watchdog low threshold.
 *        This parameter must be a number between -8388608 and 8388607
 * @retval None
 * @note Call this function after calling SDFM_FILTER_SetAwdDataSrc().
 */
void SDFM_FILTER_SetAwdThreshold(CM_SDFM_TypeDef *SDFMx,
                                 uint32_t u32Filter,
                                 int32_t i32HighThreshold,
                                 int32_t i32LowThreshold)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_THRESHOLD(i32HighThreshold));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_THRESHOLD(i32LowThreshold));

    if (READ_REG32_BIT(SDFM_FLTxCR1(u32Filter), SDFM_FLTCR1_AWFSEL) == SDFM_FILTER_AWD_CH_DATA)
    {
        i32HighThreshold *= 256;
        i32LowThreshold *= 256;
    }
    /* Set thresholds */
    MODIFY_REG32(SDFM_FLTxAWHTR(u32Filter), SDFM_FLTAWHTR_AWHT, ((uint32_t)i32HighThreshold << SDFM_FLTAWHTR_AWHT_POS));
    MODIFY_REG32(SDFM_FLTxAWLTR(u32Filter), SDFM_FLTAWLTR_AWLT, ((uint32_t)i32LowThreshold << SDFM_FLTAWLTR_AWLT_POS));
}

/**
 * @brief Set analog watchdog high/low threshold2.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  i16HighThreshold2      Analog watchdog high threshold2.
 *        This parameter must be a number between -32768 and 32767
 * @param [in]  i16LowThreshold2       Analog watchdog low threshold2.
 *        This parameter must be a number between -32768 and 32767
 * @retval None
 */
void SDFM_FILTER_SetAwdThreshold2(CM_SDFM_TypeDef *SDFMx,
                                  uint32_t u32Filter,
                                  int16_t i16HighThreshold2,
                                  int16_t i16LowThreshold2)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));

    /* Set analog watchdog thresholds2 */
    WRITE_REG32(SDFM_FLTxAWHTR2(u32Filter), ((uint32_t)i16HighThreshold2 << SDFM_FLTAWHT2_AWHT2_POS));
    WRITE_REG32(SDFM_FLTxAWLTR2(u32Filter), ((uint32_t)i16LowThreshold2 << SDFM_FLTAWLT2_AWLT2_POS));
}

/**
 * @brief Set break signal assignment to analog watchdog high/low threshold event.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32HighBreakSignal     Break signal assignment to analog watchdog high threshold event.
 *        This parameter can be any combination of @ref SDFM_Break_Signal
 * @param [in]  u32LowBreakSignal      Break signal assignment to analog watchdog low threshold event.
 *        This parameter can be any combination of @ref SDFM_Break_Signal
 * @param [in]  u32CrossZeroBreakSignal Break signal assignment to cross zero break event.
 *        This parameter can be any combination of @ref SDFM_Break_Signal
 * @retval None
 */
void SDFM_FILTER_SetAwdBreakSignal(CM_SDFM_TypeDef *SDFMx,
                                   uint32_t u32Filter,
                                   uint32_t u32HighBreakSignal,
                                   uint32_t u32LowBreakSignal,
                                   uint32_t u32CrossZeroBreakSignal)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_BREAK_SIGNAL(u32HighBreakSignal));
    DDL_ASSERT(IS_SDFM_BREAK_SIGNAL(u32LowBreakSignal));
    DDL_ASSERT(IS_SDFM_BREAK_SIGNAL(u32CrossZeroBreakSignal));

    /* Set break signals */
    MODIFY_REG32(SDFM_FLTxAWHTR(u32Filter), SDFM_FLTAWHTR_BKAWH, u32HighBreakSignal);
    MODIFY_REG32(SDFM_FLTxAWLTR(u32Filter), SDFM_FLTAWLTR_BKAWL, u32LowBreakSignal);
    MODIFY_REG32(SDFM_FLTxCPARM(u32Filter),
                 SDFM_FLTCPARM_BK_CROSS_ZERO,
                 u32CrossZeroBreakSignal << SDFM_FLTCPARM_BK_CROSS_ZERO_POS);
}

/**
 * @brief Get the status of the specified AWD flag of the specified filter.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32Flag                Filter AWD flag.
 *        This parameter can be any combination of @ref SDFM_Filter_Awd_Status_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SDFM_FILTER_GetAwdStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_FLAG(u32Flag));

    /* Return SET if one of the specified flags is SET. */
    return (en_flag_status_t)(READ_REG32_BIT(SDFM_FLTxAWSR(u32Filter), u32Flag) != 0U);
}

/**
 * @brief Clear the specified AWD flag of the specified filter.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  u32Flag                Filter AWD flag.
 *        This parameter can be any combination of @ref SDFM_Filter_Awd_Status_Flag
 * @retval None
 */
void SDFM_FILTER_ClearAwdStatus(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, uint32_t u32Flag)
{
    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_AWD_FLAG(u32Flag));

    /* Clear the selected flags */
    WRITE_REG32(SDFM_FLTxAWCFR(u32Filter), u32Flag);
}

/**
 * @brief Configures sinc filter.
 * @param [in]  SDFMx                  Pointer to SDFM instance register base.
 *        This parameter can be a value of the following:
 * @arg CM_SDFM or CM_SDFMx:         SDFM instance register base.
 * @param [in]  u32Filter              SDFM filter.
 *        This parameter can be a value of @ref SDFM_Filter
 * @param [in]  pstcSinc               Pointer to a @ref stc_sdfm_filter_sinc_t structure value that
 *        contains the configuration information of the control register.
 * @retval int32_t:
 *         - LL_OK:                   No errors occurred.
 *         - LL_ERR_INVD_PARAM:       pstcSinc == NULL.
 */
int32_t SDFM_FILTER_SincConfig(CM_SDFM_TypeDef *SDFMx, uint32_t u32Filter, const stc_sdfm_filter_sinc_t *pstcSinc)
{
    if (pstcSinc == NULL)
    {
        return LL_ERR_INVD_PARAM;
    }

    DDL_ASSERT(IS_SDFM(SDFMx));
    DDL_ASSERT(IS_SDFM_FILTER(u32Filter));
    DDL_ASSERT(IS_SDFM_FILTER_SINC_FOSR_ORDER(pstcSinc->u32SincFOSR, pstcSinc->u32SincOrder));
    DDL_ASSERT(IS_SDFM_FILTER_SINC_IOSR(pstcSinc->u32SincIOSR));

    /* Configure filter */
    WRITE_REG32(SDFM_FLTxFCR(u32Filter),
                pstcSinc->u32SincOrder | ((pstcSinc->u32SincFOSR - 1U) << SDFM_FLTFCR_FOSR_POS)
                    | (pstcSinc->u32SincIOSR - 1U));

    return LL_OK;
}

/**
 * @}
 */

#endif /* LL_SDFM_ENABLE */

/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
